{
   "Grade 1:":[
      {
         "Level before":"Does not apply."
      },
      {
         "Data structures":"No logic."
      },
      {
         "Test cases":"Does not pass any test case."
      },
      {
         "Understanding of the problem":"It shows not understanding of the problem."
      },
      {
         "Strategy used":"Could be a strategy to solve an other problem."
      }
   ],
   "Grade 2:":[
      {
         "Level before":"Does not contain ay item belonging to the level 1."
      },
      {
         "Data structures":"Has the right data estructures but they are not well implemented, bad used or they are not coherent."
      },
      {
         "Test cases":"Does not pass any test case or pases one or  two maximum."
      },
      {
         "Understanding of the problem":"It shows a very basic or alomost null understanding of the problem to be solved."
      },
      {
         "Strategy used":"The solution does not use a right approach to solve the problem. Could have been using brute force or an other approache that does not work.\nTher is not a clear purpose in the source code and in the strategy (i.e difficult to follow)."
      }
   ],
   "Grade 3:":[
      {
         "Level before":"Does not contain any item from the level 2."
      },
      {
         "Data structures":"The right structures need to solve the problem exist and are well implemented."
      },
      {
         "Test cases":"Could pass some test cases."
      },
      {
         "Understanding of the problem":"Shows a partial understanding of how to solve the problem."
      },
      {
         "Strategy used":"The strategy used to solve the problem is close to the one proposed."
      }
   ],
   "Grade 4:":[
      {
         "Level before":"Does not apply"
      },
      {
         "Data structures":"Has problems with the definition of the data types, conditionals or number of cycles."
      },
      {
         "Test cases":"Passes some test cases."
      },
      {
         "Understanding of the problem":"Shows a complete understanding of how to solve the problem\nDoes not identify small details like border cases."
      },
      {
         "Strategy used":"The strategy used to solve the problem is clear, easy to follow and according to the expected.."
      }
   ],
   "Grade 5:":[
      {
         "Level before":"Does not apply."
      },
      {
         "Data structures":"Does not have any prolbme with data type, conditionals, cycles, etc."
      },
      {
         "Test cases":"Passes all test cases."
      },
      {
         "Understanding of the problem":"Shows a full understanding of how to solve the problem."
      },
      {
         "Strategy used":"The strategy used to solve the problem is clear, easy to read and according to the expected."
      }
   ]
}